timetide.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Time tide</title>
<meta name="author" content="Dr. Avinash Malik" />
<meta name="generator" content="Org Mode" />

</head>
<body>
<div id="content" class="content">
<h1 class="title">Time tide</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgbcad157">Time tide is a new programming language</a></li>
<li><a href="#org6286b59">Installing the Time tide compiler(s)</a></li>
<li><a href="#orgd48a473">We are now ready to compile our first example program</a>
<ul>
<li><a href="#org3f8550a">Compiling the abro (shared memory) program</a></li>
<li><a href="#org91c0622">Compiling the abro example (distributed memory) program</a></li>
</ul>
</li>
<li><a href="#org4a65718">The Time tide language</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgbcad157" class="outline-2">
<h2 id="orgbcad157">Time tide is a new programming language</h2>
<div class="outline-text-2" id="text-orgbcad157">
<ol class="org-ol">
<li>It allows building finite state machines.</li>
<li>It allows developing synchronous concurrent programs.</li>
<li>It allows for shared memory or distributed memory concurrency.</li>
<li>The compiler produces efficient C++ code, which allows for easy
interaction with native code and deployment on embedded platforms.</li>
<li>Time tide language and tool suite is a work in progress &#x2013; expect
bugs and things to change daily</li>
</ol>
</div>
</div>
<div id="outline-container-org6286b59" class="outline-2">
<h2 id="org6286b59">Installing the Time tide compiler(s)</h2>
<div class="outline-text-2" id="text-org6286b59">
<ol class="org-ol">
<li>Time tide uses multiple compiler tool chains.</li>
<li>You are expected to have installed C++ compilers with support for
at least C++-17 standard.</li>
<li>Pull the Time tide compiler from:
<a href="https://github.com/PRETgroup/timetide">https://github.com/PRETgroup/timetide</a></li>
<li>Install the Ocaml programming language compiler from here:
<a href="https://ocaml.org/install#linux_mac_bsd">https://ocaml.org/install#linux_mac_bsd</a></li>
<li>Install dune with command <code>opam install dune</code></li>
<li>Now go to the timetide directory and do command <code>dune build</code></li>
<li>It will <b>not</b> compile and list the missing libraries.</li>
<li>You will need to manually install the libraries like so: <code>opam install &lt;lib-name&gt;</code></li>
<li>You will need to install the following libraries:
<code>pretty_expressive</code>
<code>ppx_deriving</code>
<code>ppx_sexp_conv</code>
<code>sexplib</code>
<code>base</code></li>
<li>Once all the libraries are installed you should be able to build
the compiler using <code>dune build</code> in the timetide directory.</li>
<li>Download and install the Rust programming language compiler from:
<a href="https://rustlang.org">Rust</a></li>
<li>Pull the Sysrust intermediate language compiler from:
<a href="https://github.com/amal029/sysrust">https://github.com/amal029/sysrust</a></li>
<li>Go inside the Sysrust compiler directory and run: <code>make br</code></li>
<li>Download and pull the Time tide example directory from:
<a href="https://github.com/PRETgroup/Timetide_tests">https://github.com/PRETgroup/Timetide_tests</a></li>
<li>Go inside the <code>Timetide_tests</code> directory and run the following
command: <code>COMPILE_SWITCH=sysrs FNAME="abro"
      SYSRUST_DIR=&lt;path-of-sysrust-compiler-dir&gt;
      TIMETIDE_DIR=&lt;path-of-timetide-compiler-dir&gt; make cleanall</code></li>
<li>In the above command replace the <code>&lt;path-of-sysrust-compiler-dir&gt;</code>
with where you have downloaded the individual timetide and sysrust
compilers.</li>
<li>Now run the command: <code>COMPILE_SWITCH=sysrs FNAME="abro"
      SYSRUST_DIR=&lt;path-of-sysrust-compiler-dir&gt;
      TIMETIDE_DIR=&lt;path-of-timetide-compiler-dir&gt;
      compilers</code> &#x2013; this will build all the compilers.</li>
</ol>
</div>
</div>
<div id="outline-container-orgd48a473" class="outline-2">
<h2 id="orgd48a473">We are now ready to compile our first example program</h2>
<div class="outline-text-2" id="text-orgd48a473">
<p>
We will use the <code>abro.tt</code> program in <code>Timetide_tests</code> directory as our
first program.
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #973300;">main</span>() {
  <span style="color: #005f5f;">int</span> <span style="color: #005e8b;">channel</span> A delay 1;
  <span style="color: #005f5f;">int</span> <span style="color: #005e8b;">channel</span> B delay 1;
  <span style="color: #005f5f;">int</span> <span style="color: #005e8b;">channel</span> R delay 2;
  <span style="color: #005f5f;">int</span> <span style="color: #005e8b;">channel</span> O delay 1;
  {
    <span style="font-weight: bold;">for</span> (<span style="color: #005f5f;">int</span> <span style="color: #005e8b;">i</span>:1:99) {
      abort(R) {                <span style="color: #77492f;">/* </span><span style="color: #77492f;">preemption when channel has data</span><span style="color: #77492f;"> */</span>
        <span style="color: #77492f;">/* </span><span style="color: #77492f;">Wait for A and B in parallel</span><span style="color: #77492f;"> */</span>
        {<span style="color: #005f5f;">run</span> <span style="color: #973300;">waitA</span>(A);}&lt;&gt;{<span style="color: #005f5f;">run</span> <span style="color: #973300;">waitB</span>(B);};
        <span style="color: #005f5f;">send</span> <span style="color: #973300;">O</span>(100);            <span style="color: #77492f;">/* </span><span style="color: #77492f;">send O once both are received</span><span style="color: #77492f;"> */</span>
        <span style="color: #77492f;">/* </span><span style="color: #77492f;">abort when R is present and restart</span><span style="color: #77492f;"> */</span>
        task(period=1,duration=0,offset=0){;} <span style="color: #77492f;">/* </span><span style="color: #77492f;">halt</span><span style="color: #77492f;"> */</span>
      }
    } <span style="color: #77492f;">/* </span><span style="color: #77492f;">loop back</span><span style="color: #77492f;"> */</span>
  }&lt;&gt; <span style="color: #77492f;">/* </span><span style="color: #77492f;">synchronous parallel concurrency</span><span style="color: #77492f;"> */</span>
    {<span style="color: #77492f;">/*</span><span style="color: #77492f;">The environment</span><span style="color: #77492f;">*/</span>
      {<span style="color: #005f5f;">send</span> <span style="color: #973300;">A</span>(1);}&lt;&gt;{<span style="color: #005f5f;">send</span> <span style="color: #973300;">B</span>(1);};
    }
};
<span style="color: #77492f;">/* </span><span style="color: #77492f;">Other functions/reactions being used inside main</span><span style="color: #77492f;"> */</span>
<span style="color: #973300;">waitA</span>(input <span style="color: #005f5f;">int</span> <span style="color: #005e8b;">A</span>) {abort(A) {task(period=1,duration=0,offset=0){;}}};
<span style="color: #973300;">waitB</span>(input <span style="color: #005f5f;">int</span> <span style="color: #005e8b;">B</span>) {abort(B) {task(period=1,duration=0,offset=0){;}}}
</pre>
</div>

<ol class="org-ol">
<li>The code above is a <b>shared</b> memory synchronous program.</li>
<li>The program' entry point is <code>main</code>.</li>
<li>The program has three modules/functions/reactions: <code>waitA</code>,
<code>waitB</code>, and <code>main</code>.</li>
<li>The <code>main</code> function waits for some data to be available on
<code>channels</code> A and B in synchronous parallel.</li>
<li>Once the channel data is received; <code>main</code> sends data on channel O.</li>
<li>If during the process of waiting if any data is available on
channel R, <code>main</code> pre-empts waiting for A and B and the program is
reset.</li>
<li>Channels are typed and have an associated delay.</li>
<li>In the <code>abro.tt</code> program sending data in channel A or B makes it
available after a single so called <code>tick</code>.</li>
<li>Sending data in channel R makes it available after two ticks.</li>
<li>The concept of a <code>tick</code> is central to programming in Time tide.</li>
<li>Tick is the synchronous (logical) clock running the whole program.</li>
</ol>
</div>
