timetide.org
** Compiling the abro (shared memory) program
   1. Run the command: ~COMPILE_SWITCH=sysrs FNAME="abro"
      SYSRUST_DIR=<path-of-sysrust-compiler-dir>
      TIMETIDE_DIR=<path-of-timetide-compiler-dir> make~ -- this will
      produce three files ~abro.sysrs~ and ~abro.cpp~ and ~abro.h~.
   2. The file ~abro.sysrs~ is the intermediate representation of the
      ~abro.tt~ program in a synchronous format.
   3. Files ~abro.cpp~ and ~abro.h~ are the generated C++ and header,
      respectively.
   4. The code snippet below shows the part of the generated ~main~
      function. The generated ~main~ function is in namespace ~abro~ --
      always the name of the ~.tt~ file.
   5. You need to now write a ~main.cpp~ file that provides the input
      and output functions.
      #+begin_src C++
	namespace abro {
	  //....
	  int main(void) {
	    read_inputs();		// provide this function
	    //...
	    write_outputs();		// provide this function
	    pre_eq_curr();
	    reset_curr();
	    return 0;
	  }
	}
      #+end_src
   6. The example ~main.cpp~ file is below. The file is available in
      ~Timetide_tests~ directory to modify.
      #+begin_src C++
	#include "abro.h"
	#include <cassert>
	#include <iostream>
	int mtick() {
	  char b = '\0';
	  int k = scanf("%c", &b);
	  return b;
	}
	// In this case there are no inputs and outputs to abro.tt
	void abro::read_inputs() {}
	void abro::write_outputs() {}

	// The main function
	int main(void) {
	  while (1) {
	    // Run the abro program
	    abro::main();
	    // Then we are done with the tick.
	    if (mtick() == 'd')
	      break;
	  }
	  return 0;
	}
      #+end_src
   7. Once we have the ~main.cpp~ file we can compile the ~abro~ example
      to a binary using the command: ~COMPILE_SWITCH=sysrs FNAME="abro"
      SYSRUST_DIR=<path-of-sysrust-compiler-dir>
      TIMETIDE_DIR=<path-of-timetide-compiler-dir> EXTRA_FLAGS="-DDEBUG"
      exe~ -- notice the ~-DDEBUG~ macro being provided.
   8. We can finally run the program using the command:
      ~COMPILE_SWITCH=sysrs FNAME="abro"
      SYSRUST_DIR=<path-of-sysrust-compiler-dir>
      TIMETIDE_DIR=<path-of-timetide-compiler-dir> EXTRA_FLAGS="-DDEBUG"
      run~

