timetide.html
<div id="outline-container-org3f8550a" class="outline-3">
<h3 id="org3f8550a">Compiling the abro (shared memory) program</h3>
<div class="outline-text-3" id="text-org3f8550a">
<ol class="org-ol">
<li>Run the command: <code>COMPILE_SWITCH=sysrs FNAME="abro"
      SYSRUST_DIR=&lt;path-of-sysrust-compiler-dir&gt;
      TIMETIDE_DIR=&lt;path-of-timetide-compiler-dir&gt; make</code> &#x2013; this will
produce three files <code>abro.sysrs</code> and <code>abro.cpp</code> and <code>abro.h</code>.</li>
<li>The file <code>abro.sysrs</code> is the intermediate representation of the
<code>abro.tt</code> program in a synchronous format.</li>
<li>Files <code>abro.cpp</code> and <code>abro.h</code> are the generated C++ and header,
respectively.</li>
<li>The code snippet below shows the part of the generated <code>main</code>
function. The generated <code>main</code> function is in namespace <code>abro</code> &#x2013;
always the name of the <code>.tt</code> file.</li>
<li><p>
You need to now write a <code>main.cpp</code> file that provides the input
and output functions.
</p>
<div class="org-src-container">
<pre class="src src-C++"><span style="font-weight: bold;">namespace</span> <span style="color: #003497;">abro</span> {
  <span style="color: #77492f;">//</span><span style="color: #77492f;">....</span>
  <span style="color: #005f5f;">int</span> <span style="color: #973300;">main</span>(<span style="color: #005f5f;">void</span>) {
    read_inputs();              <span style="color: #77492f;">// </span><span style="color: #77492f;">provide this function</span>
    <span style="color: #77492f;">//</span><span style="color: #77492f;">...</span>
    write_outputs();            <span style="color: #77492f;">// </span><span style="color: #77492f;">provide this function</span>
    pre_eq_curr();
    reset_curr();
    <span style="font-weight: bold;">return</span> 0;
  }
}
</pre>
</div></li>
<li><p>
The example <code>main.cpp</code> file is below. The file is available in
<code>Timetide_tests</code> directory to modify.
</p>
<div class="org-src-container">
<pre class="src src-C++"><span style="color: #531ab6;">#include</span> <span style="color: #3548cf;">"abro.h"</span>
<span style="color: #531ab6;">#include</span> <span style="color: #3548cf;">&lt;cassert&gt;</span>
<span style="color: #531ab6;">#include</span> <span style="color: #3548cf;">&lt;iostream&gt;</span>
<span style="color: #005f5f;">int</span> <span style="color: #973300;">mtick</span>() {
  <span style="color: #005f5f;">char</span> <span style="color: #005e8b;">b</span> = <span style="color: #3548cf;">'\0'</span>;
  <span style="color: #005f5f;">int</span> <span style="color: #005e8b;">k</span> = scanf(<span style="color: #3548cf;">"%c"</span>, &amp;b);
  <span style="font-weight: bold;">return</span> b;
}
<span style="color: #77492f;">// </span><span style="color: #77492f;">In this case there are no inputs and outputs to abro.tt</span>
<span style="color: #005f5f;">void</span> <span style="color: #003497;">abro</span>::<span style="color: #973300;">read_inputs</span>() {}
<span style="color: #005f5f;">void</span> <span style="color: #003497;">abro</span>::<span style="color: #973300;">write_outputs</span>() {}

<span style="color: #77492f;">// </span><span style="color: #77492f;">The main function</span>
<span style="color: #005f5f;">int</span> <span style="color: #973300;">main</span>(<span style="color: #005f5f;">void</span>) {
  <span style="font-weight: bold;">while</span> (1) {
    <span style="color: #77492f;">// </span><span style="color: #77492f;">Run the abro program</span>
    <span style="color: #003497;">abro</span>::main();
    <span style="color: #77492f;">// </span><span style="color: #77492f;">Then we are done with the tick.</span>
    <span style="font-weight: bold;">if</span> (mtick() == <span style="color: #3548cf;">'d'</span>)
      <span style="font-weight: bold;">break</span>;
  }
  <span style="font-weight: bold;">return</span> 0;
}
</pre>
</div></li>
<li>Once we have the <code>main.cpp</code> file we can compile the <code>abro</code> example
to a binary using the command: <code>COMPILE_SWITCH=sysrs FNAME="abro"
      SYSRUST_DIR=&lt;path-of-sysrust-compiler-dir&gt;
      TIMETIDE_DIR=&lt;path-of-timetide-compiler-dir&gt; EXTRA_FLAGS="-DDEBUG"
      exe</code> &#x2013; notice the <code>-DDEBUG</code> macro being provided.</li>
<li>We can finally run the program using the command:
<code>COMPILE_SWITCH=sysrs FNAME="abro"
      SYSRUST_DIR=&lt;path-of-sysrust-compiler-dir&gt;
      TIMETIDE_DIR=&lt;path-of-timetide-compiler-dir&gt; EXTRA_FLAGS="-DDEBUG"
      run</code></li>
</ol>
</div>
</div>
